#introduction
print("""Καλωσήρθατε στο φαντασμαγορικό παιχνίδι ερωτήσεων με θέμα το Charis Romas Television Universe!
Καλείστε ν' απαντήσετε σε 5 ερωτήσεις πολλαπλής επιλογής. Πληκτρολογήστε 'a', 'b' ή 'c' για να επιλέξετε την αντίστοιχη απάντηση.
Κάθε σωστή απάντηση αξίζει 1 πόντο. Πόσους πόντους θα καταφέρετε να συγκεντρώσετε;
Οποιαδήποτε στιγμή θελήσετε να σταματήσετε το παιχνίδι, πληκτρολογήστε 'x'.
""")
points = 0

#1st question
print("""1η ερώτηση: Ποιό από τα παρακάτω σήριαλ, σε σενάριο Χάρη Ρώμα, είναι το παλαιότερο;
(a) Κωνσταντίνου και Ελένης
(b) Οι Μεν και οι Δεν
(c) Ο Κακός Βεζύρης""")
answer = input("Η απάντησή σας: ").lower()
if answer == "b" or answer == "β":
    print("Σωστά! Κερδίσατε 1 πόντο. Ετοιμαστείτε για την επόμενη ερώτηση.")
    points += 1
    print()
elif answer == "x" or answer == "χ":
    print("Ανεγκέφαλοι ερωτύλοι! Ελπίζουμε να ξαναπαίξετε κάποια άλλη φορά. Προς το παρόν, αντίο!")
    quit()
else:
    print("Λάθος! Ελπίζουμε στην επόμενη ερώτηση να τα πάτε καλύτερα.")
    print()

#2nd question
print("""2η ερώτηση: Πώς λεγόταν ο χαρακτήρας που υποδύθηκε ο Χάρης Ρώμας, στο σήριαλ «Λίφτινγκ»;
(a) Γεράσιμος Μαντούβαλος
(b) Κλέων Βεζύρης
(c) Μίμης Μεταξάς""")
answer = input("Η απάντησή σας: ").lower()
if answer == "a" or answer == "α":
    print("Σωστά! Κερδίσατε 1 πόντο. Ετοιμαστείτε για την επόμενη ερώτηση.")
    points += 1
    print()
elif answer == "x" or answer == "χ":
    print("Ανεγκέφαλοι ερωτύλοι! Ελπίζουμε να ξαναπαίξετε κάποια άλλη φορά. Προς το παρόν, αντίο!")
    quit()
else:
    print("Λάθος! Ελπίζουμε στην επόμενη ερώτηση να τα πάτε καλύτερα.")
    print()

#3rd question
print("""3η ερώτηση: Πώς λεγόταν ο απατεώνας φίλος της Ελένης Βλαχάκη;
(a) Μιχαλάκης
(b) Νικόλας Βαρθακούλιας
(c) Νιόνιος ο speed""")
answer = input("Η απάντησή σας: ").lower()
if answer == "c" or answer == "γ":
    print("Σωστά! Κερδίσατε 1 πόντο. Ετοιμαστείτε για την επόμενη ερώτηση.")
    points += 1
    print()
elif answer == "x" or answer == "χ":
    print("Ανεγκέφαλοι ερωτύλοι! Ελπίζουμε να ξαναπαίξετε κάποια άλλη φορά. Προς το παρόν, αντίο!")
    quit()
else:
    print("Λάθος! Ελπίζουμε στην επόμενη ερώτηση να τα πάτε καλύτερα.")
    print()

#4th question
print("""4η ερώτηση: Ποια από τις παρακάτω συνεργάστηκε συχνά με τον Χάρη Ρώμα ως σεναριογράφος;
(a) Άννα Χατζησοφιά
(b) Ελένη Ράντου
(c) Τζόυς Ευείδη""")
answer = input("Η απάντησή σας: ").lower()
if answer == "a" or answer == "α":
    print("Σωστά! Κερδίσατε 1 πόντο. Ετοιμαστείτε για την επόμενη ερώτηση.")
    points += 1
    print()
elif answer == "x" or answer == "χ":
    print("Ανεγκέφαλοι ερωτύλοι! Ελπίζουμε να ξαναπαίξετε κάποια άλλη φορά. Προς το παρόν, αντίο!")
    quit()
else:
    print("Λάθος! Ελπίζουμε στην επόμενη ερώτηση να τα πάτε καλύτερα.")
    print()

#5th question
print("""5η και τελευταία ερώτηση: Μαζί με ποιο ζωάκι βρέθηκε να συγκατοικεί ο Αλέξανδρος Φικιώρης;
(a) Σκυλάκι
(b) Γουρουνάκι
(c) Ταραντούλα""")
answer = input("Η απάντησή σας: ").lower()
if answer == "b" or answer == "β":
    print("Σωστά! Κερδίσατε 1 πόντο.")
    points += 1
    print()
elif answer == "x" or answer == "χ":
    print("Ανεγκέφαλοι ερωτύλοι! Ελπίζουμε να ξαναπαίξετε κάποια άλλη φορά. Προς το παρόν, αντίο!")
    quit()
else:
    print("Λάθος!")
    print()

#end
print("Έφτασε η στιγμή της αλήθειας!")
if points == 0:
    print(f"Χλεμπονιάρη γραμματικέ, συγκέντρωσες μόλις {points} πόντους. Ελπίζουμε την επόμενη φορά να τα καταφέρεις καλύτερα, στραβάδι!")
elif points == 1:
        print(f"Χλεμπονιάρη γραμματικέ, συγκέντρωσες μόλις 1 πόντο. Ελπίζουμε την επόμενη φορά να τα καταφέρεις καλύτερα, στραβάδι!")
elif points in [2, 3]:
    print(f"Γκαρσόνα Β', συγκέντρωσες {points} πόντους. Ελπίζουμε την επόμενη φορά να τα καταφέρεις καλύτερα, ατάλαντη!")
elif points == 4:
    print("Βλαχάκοου, συγκέντρωσες 4 πόντους. Λίγο ακόμη και θα γίνεις μη-πρωταγωνίστρια του μη-θεάτρου.")
else:
    print("Συγχαρητήρια! Απάντησες σωστά σε όλες τις απαντήσεις! Χρίζεσαι επίκουρος καθηγητής βυζαντινολογίας! Get a life!")